app/controllers/sessions_controller.rb

	def create
		auth = request.env["omniauth.auth"]
		info = auth
		user = Kul.find_by_provider_and_uid(auth["provider"], auth["uid"]) || Kul.create_with_omniauth(auth)
---
INSERT INTO `kuls` (`created_at`, `name`, `provider`, `uid`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 Mar 2012 14:37:00 UTC +00:00], ["name", "Semih Özköroğlu"], ["provider", "google"], ["uid", "sem@bil.omu.edu.tr"], ["updated_at", Mon, 26 Mar 2012 14:37:00 UTC +00:00]]
SELECT `kuls`.* FROM `kuls` WHERE `kuls`.`uid` = 'sem@bil.omu.edu.tr' AND `kuls`.`provider` = 'google' LIMIT 1